Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/health_services/mental_health/inspector_of_mental_health_services.html.txt.tmx
Source language: en
Languages: ga

source: Inspector of Mental Health Services
ga: Cigirí na Seirbhísí Meabhair-Shláinte

source: The Mental Health Commission appoints the Inspector of Mental Health Services who is a consultant psychiatrist, as required by the Mental Health Act 2001
ga: An Coimisiún Meabhair-Shláinte a cheapann Cigire na Seirbhísí Meabhair-Shláinte ar sícriatraí comhairleach é, mar a éilítear ag an Acht Meabhair-Shláinte 2001

source: The Office of Inspector of Mental Health Services is made up of the Inspector of Mental Health Services and a team of assistant inspectors
ga: Tá Oifig Chigire na Seirbhísí Meabhair-Shláinte comhdhéanta de Chigire na Seirbhísí Meabhair-Shláinte agus foireann cigirí cúnta

source: The assistant inspectors are professionals from a range of backgrounds including nursing, social work, psychiatry, occupational therapy and clinical psychology
ga: Is daoine gairmiúla iad na cigirí cúnta ó raon cúlraí lena n-áirítear altranas, obair shóisialta, síciatracht, teiripe shaothair agus síceolaíocht chliniciúil

source: The Inspector of Mental Health Services carries out a programme of inspections of mental health facilities
ga: Déanann Cigire na Seirbhísí Meabhair-Shláinte clár cigireachtaí ar shaoráidí meabhair-shláinte

source: The Inspector's functions are:
ga: Is iad seo a leanas feidhmeanna an Chigire:

source: • To visit and inspect every approved centre at least once a year
ga: • Cúirt a thabhairt ar gach ionad ceadaithe uair sa bhliain ar a laghad

source: Approved centres are hospitals or in-patient facilities for the treatment of mental illness or disorder
ga: Is éard is ionad ceadaithe ann ná ospidéal nó saoráid d’othair chónaitheacha chun cóireáil a dhéanamh ar mheabhairghalair nó ar neamhord meabhrach

source: • To carry out a review of mental health services every year and report to the Commission on the quality of care and treatment given to people receiving mental health services and other aspects of the services
ga: • Athbhreithniú a dhéanamh ar sheirbhísí meabhair-shláinte gach bliain agus tuairisciú don Choimisiún faoi cháilíocht na cóireála atá á tabhairt do dhaoine atá ag fáil seirbhísí meabhair-shláinte agus gnéithe eile na seirbhísí

source: The Inspector has various powers to enter and inspect premises, to obtain records, documentation and other information from the staff and to take evidence, relating to the inspection, under oath
ga: Tá cumhachtaí éagsúla ag na cigirí dul isteach agus cigireacht a dhéanamh ar áitrimh, taifid a fháil, doiciméadú agus eolas ar bith eile a fháil ón bhfoireann oibre agus fianaise atá bainteach leis an gcigireacht, a thogáil faoi mhionn

source: The Inspector may be requested by the Mental Health Commission to carry out an inquiry into:
ga: D'fhéadfadh sé go n-iarradh an Coimisinéar ar an gCigire fiosrúchán a dhéanamh faoi:

source: • Any approved centre or any premises where mental health services are provided
ga: • Aon ionad ceadaithe nó aon áitrimh a gcuirtear seirbhís ar fáil iontu

source: • The care and treatment provided to a specified patient, whether voluntary or involuntary
ga: • An cúram agus cóireáil atá dá fháil ag othar faoi leith, bíodh siad deonach nó neamhdheonach

source: • Any other appropriate matter
ga: • Aon ábhar cuí eile

source: The summaries of inspection reports are available on mrcirl.ie
ga: Tá achoimrí na dtuarascálacha cigireachta ar fáil ar mrcirl.ie

source: If you have a complaint about a mental health service, you should in the first instance contact the service provider who is required by law to have a clear complaints procedure in place under Article 31 of the Mental Health Act 2001 (Approved Centres) Regulations 2006
ga: Má bhíonn gearán agat faoi sheirbhís meabhair-shláinte, ba chóir duit ar an gcéad dul síos, teagmháil a dhéanamh le soláthraí seirbhíse a gceanglaítear air nó uirthi de réir dlí nós imeachta gearán soiléir a bheith i bhfeidhm faoi Airteagal 31 de na Rialacháin um an Acht Meabhair-Shláinte 2001 (Ionaid Cheadaithe) 2006

source: If you contact any member of staff of the Mental Health Commission in relation to a complaint, you will be advised to contact the service provider as the Mental Health Commission does not handle individual complaints
ga: Má dhéanann tú teagmháil le haon bhall foirne den Choimisiún Meabhair-Shláinte maidir le gearán, tabharfar comhairle duit teagmháil a dhéanamh leis an soláthraí seirbhíse toisc nach láimhseálann an Coimisiún Meabhair-Shláinte le gearáin aonair

source: If you contact the Mental Health Commission in relation to a concern about a service, you will be directed to the Inspectorate of Mental Health Services if appropriate
ga: Má dhéanann tú teagmháil leis an gCoimisiún Meabhair-Shláinte maidir le imní i ndáil le seirbhís, cuirfear ar aghaidh chuig Cigireacht na Seirbhísí Meabhair-Shláinte tú más cuí

source: The Inspectorate logs all concerns that relates to mental health services and these are taken into account on inspections. Where to apply Mental Health Commission St
ga: Logálann an Chigireacht gach ábhar imní a bhaineann le seirbhísí meabhair-shláinte agus cuirtear iad sin san áireamh le linn cigireachta
